import 'package:flutter/material.dart';

class TermsAndConditionsPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
       appBar: AppBar(
        backgroundColor: const Color(0xFFE966A0),
        title: const Text(
          'ข้อกำหนดและเงื่อนไขการให้บริการ',
          style: TextStyle(
            fontSize: 18,
            color: Colors.white,
            fontWeight: FontWeight.bold,
          ),
        ),
         iconTheme: const IconThemeData(color: Colors.white),
      ),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                '1. การสร้างบัญชี',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                '1.1 การลงทะเบียน\n'
                'คุณต้องทำการลงทะเบียนด้วยข้อมูลที่ถูกต้องและครบถ้วน รวมถึงชื่อผู้ใช้ อีเมล หมายเลขโทรศัพท์ และตั้งรหัสผ่านเพื่อเข้าถึงแอปพลิเคชัน',
              ),
              SizedBox(height: 10),
              Text(
                '1.2 ความรับผิดชอบในการให้ข้อมูล\n'
                'คุณต้องรับผิดชอบในการให้ข้อมูลที่เป็นจริงและสมบูรณ์ การให้ข้อมูลเท็จหรือไม่ครบถ้วน อาจนำไปสู่การระงับหรือยุติบัญชีการใช้งานของคุณได้ทันที',
              ),
              SizedBox(height: 10),
              Text(
                '1.3 การรักษาความปลอดภัยของบัญชี\n'
                'คุณมีหน้าที่รับผิดชอบต่อการรักษาความลับของรหัสผ่านและข้อมูลบัญชีอื่น ๆ แอปพลิเคชันจะไม่รับผิดชอบต่อการเข้าถึงที่ไม่ได้รับอนุญาตซึ่งอาจเกิดจากความผิดพลาดของผู้ใช้ที่ไม่สามารถเก็บความลับของข้อมูลตนเองได้',
              ),
              SizedBox(height: 20),
              Text(
                '2. การใช้งานบริการ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                '2.1 การใช้งานตามวัตถุประสงค์ที่ถูกต้อง\n'
                'คุณต้องใช้แอปพลิเคชันเพื่อตามวัตถุประสงค์ที่กำหนดไว้เท่านั้น เช่น เพื่อแลกเปลี่ยนสินค้ามือสองกับผู้ใช้อื่น ห้ามใช้บริการในการกระทำที่ผิดกฎหมายหรืออาจก่อให้เกิดความเสียหายต่อบุคคลอื่น',
              ),
              SizedBox(height: 10),
              Text(
                '2.2 การกระทำที่ไม่ได้รับอนุญาต\n'
                'ห้ามกระทำการอันเป็นการหลอกลวง แอบอ้างตัวตน หรือการเสนอขายสินค้าที่ไม่เป็นไปตามข้อกำหนด เช่น สินค้าที่ไม่ได้รับอนุญาตในการแลกเปลี่ยน เพิ่มสินค้าที่ผิดกฎหมาย การกระทำเช่นนี้อาจนำไปสู่การระงับการใช้บริการ',
              ),
              SizedBox(height: 20),
              Text(
                '3. ความเป็นเจ้าของและการแลกเปลี่ยนสินค้า',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                '3.1 ความรับผิดชอบของผู้ใช้\n'
                'ผู้ใช้มีหน้าที่ในการแลกเปลี่ยนสินค้าอย่างโปร่งใสและเป็นธรรม แอปพลิเคชันเป็นเพียงแพลตฟอร์มสำหรับการเชื่อมต่อระหว่างผู้ใช้ และไม่ได้มีส่วนเกี่ยวข้องในการเป็นเจ้าของสินค้าหรือการยืนยันคุณภาพของสินค้าที่แลกเปลี่ยนกัน',
              ),
              SizedBox(height: 10),
              Text(
                '3.2 การรับประกันสินค้า\n'
                'แอปพลิเคชันจะไม่รับผิดชอบต่อความเสียหาย การสูญหาย หรือข้อบกพร่องใด ๆ ของสินค้าที่แลกเปลี่ยน คุณต้องตรวจสอบสินค้าและทำความเข้าใจความเสี่ยงของการแลกเปลี่ยนด้วยตนเอง',
              ),
              SizedBox(height: 20),
              Text(
                '4. การยกเลิกและการยุติการให้บริการ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                '4.1 การระงับการใช้งานชั่วคราวหรือถาวร\n'
                'แอปพลิเคชันขอสงวนสิทธิ์ในการระงับหรือยุติการให้บริการแก่ผู้ใช้ที่ไม่ปฏิบัติตามข้อกำหนดการใช้งานนี้โดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า โดยเฉพาะผู้ที่มีการกระทำผิดซ้ำ ๆ หรือมีพฤติกรรมที่เป็นอันตรายต่อชุมชน',
              ),
              SizedBox(height: 10),
              Text(
                '4.2 กระบวนการยกเลิกการใช้บริการ\n'
                'หากคุณต้องการยกเลิกบัญชี สามารถติดต่อฝ่ายสนับสนุนลูกค้าเพื่อดำเนินการตามขั้นตอนที่กำหนด การยกเลิกจะมีผลทันทีเมื่อผ่านการยืนยันข้อมูล',
              ),
              SizedBox(height: 20),
              Text(
                '5. การแก้ไขข้อกำหนด',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                '5.1 การแก้ไขข้อกำหนดและเงื่อนไข\n'
                'เราอาจทำการแก้ไข ปรับปรุง หรือเพิ่มเติมข้อกำหนดนี้ได้เป็นระยะ ทั้งนี้จะมีการแจ้งให้ทราบถึงการเปลี่ยนแปลงสำคัญ หากคุณยังคงใช้บริการต่อไปหลังจากการแก้ไขข้อกำหนด ถือว่าคุณยอมรับข้อกำหนดและเงื่อนไขที่ปรับปรุงแล้ว',
              ),
              SizedBox(height: 10),
              Text(
                '5.2 สิทธิในการยอมรับหรือปฏิเสธ\n'
                'หากคุณไม่ยอมรับข้อกำหนดที่ปรับปรุงใหม่ สามารถยกเลิกการใช้งานได้โดยติดต่อฝ่ายสนับสนุนลูกค้า',
              ),
              SizedBox(height: 20),
              Text(
                '6. การจำกัดความรับผิดชอบ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                'แอปพลิเคชันไม่รับผิดชอบต่อความถูกต้อง ความน่าเชื่อถือ หรือความสมบูรณ์ของเนื้อหาที่ผู้ใช้สร้างขึ้นเอง ผู้ใช้มีหน้าที่ในการตรวจสอบและรับความเสี่ยงเองเมื่อใช้ข้อมูลที่ได้รับจากแอปพลิเคชัน',
              ),
              SizedBox(height: 20),
              Text(
                '7. การติดต่อ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
              SizedBox(height: 10),
              Text(
                'หากมีคำถามเกี่ยวกับข้อกำหนดและเงื่อนไขการให้บริการ คุณสามารถติดต่อเราผ่านอีเมล : supansak654@gmail.com\n'
                'เราจะพยายามตอบกลับและแก้ไขปัญหาที่คุณแจ้งมาทันทีที่เป็นไปได้',
              ),
            ],
          ),
        ),
      ),
    );
  }
}
